sivulich/TP_FINAL_MICROS_KINETIS/source/MP3Ui.c
#include "MP3Ui.h"
#include "UI.h"
#include "MP3PlayerData.h"
#include "MP3Player.h"			//hay que tratar de sacar esto de aca
#include "MP3Equalizer.h"
#include "fsl_rtc.h"
#include <stdio.h>
#include <stdlib.h>

#define STATUS_BAR_HEIGHT 20
#define BACK_BUTTON_SIZE LV_HOR_RES / 15

#define YEAR_BUFF 26
//char year_buff[26];
//char month_buff[28];
//char day_buff[82];
//char hour_buff[61];
//char min_buff[169];
#define MONTH_BUFF 28
#define DAY_BUFF 82
#define HOUR_BUFF 61
#define MIN_BUFF 169

static lv_res_t fileScreenUpdate(lv_obj_t* obj);
/*Screens*/
static lv_obj_t *baseScreen,* mainScreen, *equalizerScreen,*filesScreen,*playScreen, *settingsScreen;

/*Status bar info*/
static lv_obj_t* volumeLabel,*dateLabel,*playInfoLabel;
/*Main Screen Info*/
static lv_obj_t *mainAudioBtn,*mainEqBtn,*mainFileBtn,*mainSetBtn;
static lv_obj_t * mainBtns[4];

/*File Screen info*/
static lv_obj_t * currentFileList[MAX_FILES],*fileList[2];//*fileListBackBtn;
static unsigned fileListSz = 0,fileListPointer=0,newFile=0;
static char* newFileName;
static unsigned UIinit=0;

/*Equalizer Screen Info*/
static lv_obj_t *eqBackBtn,*rollers[3];

/*PlayScreen Info*/
static unsigned duration,currentTime;
static lv_obj_t* progressBar,*playBackBtn,*songNameLbl,*artistNameLbl,*prevLbl,*nextLbl,*playPauseLbl;

/*SettingsScreen Info*/
static lv_obj_t* setBackButton, *loopModeBtn, *vumeter_roller, *date_rollers[5];

/*Button styles*/
static lv_style_t style_bg,style_bgg;
static lv_style_t style_btn_rel;
static lv_style_t style_btn_pr;

/*Indev devices*/
static lv_indev_drv_t* kb_drv;
static lv_indev_t* kb_indev;

/*Groups*/
static lv_group_t * groups[SCREENS];

static void hideAllScreens()
{
	lv_obj_set_hidden(mainScreen,1);
	lv_obj_set_hidden(playScreen,1);
	lv_obj_set_hidden(equalizerScreen,1);
	lv_obj_set_hidden(filesScreen,1);
	lv_obj_set_hidden(settingsScreen,1);
}

static void setActiveGroup(int p,int qnt,lv_obj_t** ob)
{
	for (int i = 0; i < SCREENS; i++)
		if (groups[i] != 0)
		{
			if (i != p)
			{
				lv_group_del(groups[i]);
				groups[i] = 0;
			}
		}
	if (groups[p] != NULL)
		lv_group_del(groups[p]);
	groups[p] = lv_group_create();
	for(int i=0;i<qnt;i++)
		lv_group_add_obj(groups[p], ob[i]);
	lv_indev_set_group(kb_indev, groups[p]);
//	for (int i = 0; i < SCREENS; i++)
//		if (groups[i] != 0)
//		{
//			if (i != p)
//			{
//				lv_group_del(groups[i]);
//				groups[i] = 0;
//			}
//		}
			
	MP3PlayerData.currentScreen=p;
}

static int checkMP3file(char* fn, size_t sz)
{
	if (fn[sz - 1] == '3' && fn[sz - 2] == 'p' && fn[sz - 3] == 'm'&& fn[sz - 4] == '.')
		return 1;
	if (fn[sz - 1] == '3' && fn[sz - 2] == 'P' && fn[sz - 3] == 'M'&& fn[sz - 4] == '.')
			return 1;
	return 0;
}

static lv_res_t retMainScreen(lv_obj_t* obj)
{
	//lv_scr_load(mainScreen);
	hideAllScreens();
	lv_obj_set_hidden(mainScreen,0);
	
	setActiveGroup(MAIN_SCREEN,4,mainBtns);
	return LV_RES_OK;
}

static lv_res_t btn_action(lv_obj_t * btn)
{
	if (btn == mainEqBtn)
	{
		hideAllScreens();
		lv_obj_set_hidden(equalizerScreen,0);
		lv_obj_t* obs[4] = { rollers[0], rollers[1], rollers[2], eqBackBtn};
		setActiveGroup(EQ_SCREEN,4,obs);
		lv_group_set_editing(groups[EQ_SCREEN],false);
	}
	else if (btn == mainFileBtn)
	{
		fileScreenUpdate(NULL);
		hideAllScreens();
		lv_obj_set_hidden(filesScreen,0);
		lv_obj_t * obs[2]={fileList[fileListPointer]};
		setActiveGroup(FILE_SCREEN0 + fileListPointer,1, obs);
		lv_group_set_editing(groups[FILE_SCREEN0+fileListPointer],true);
	}
	else if(btn == mainAudioBtn)
	{
		setActiveGroup(PLAY_SCREEN,1,&playBackBtn);
		hideAllScreens();
		lv_obj_set_hidden(playScreen,0);
	}
	else if(btn == mainSetBtn)
	{
		hideAllScreens();
		lv_obj_set_hidden(settingsScreen,0);
		lv_obj_t * obs[8]={loopModeBtn, vumeter_roller, date_rollers[0], date_rollers[1], date_rollers[2], date_rollers[3], date_rollers[4], setBackButton};
		setActiveGroup(SETTING_SCREEN,8,obs);
	}
	return LV_RES_OK; /*Return OK because the button matrix is not deleted*/
}

static lv_res_t fileScreenUpdate(lv_obj_t* obj)
{
	unsigned pos = 0;

	if(obj!=NULL)
	{
		for (unsigned i = 0; i < fileListSz; i++)
		{
			if (obj == currentFileList[i])
			{
				pos = i;
				break;
			}
		}
		UI.exitFile();
		UI.setPos(pos);
		if (UI.input(UI_SELECT) == 1)
		{
			retMainScreen(NULL);
			return LV_RES_OK;
		}
	}

	if(UIinit>1)
		UIinit=UI.init();
	char* currFile = UI.getFile();
//	if(currFile==(char*)-1)
//	{
//		UIinit=2;
//	}

	if (currFile != 0 && currFile!=(char*)-1)
	{
		newFile=1;
		newFileName=currFile;
		setActiveGroup(PLAY_SCREEN,1,&playBackBtn);
		hideAllScreens();
		lv_obj_set_hidden(playScreen,0);
	}
	else
	{
		MP3Player.update();
		//hide the current list and change to the other

		lv_obj_set_hidden(fileList[fileListPointer], true);
		fileListPointer = (fileListPointer + 1) % 2;
		lv_obj_set_hidden(fileList[fileListPointer], false);
		
		//delete the list and group to re-create them 
		int width=lv_obj_get_width(fileList[fileListPointer]);
		int height=lv_obj_get_height(fileList[fileListPointer]);
		lv_obj_del(fileList[fileListPointer]);
		MP3Player.update();
		//re-creating...
		fileList[fileListPointer] = lv_list_create(filesScreen, NULL);
		lv_obj_set_height(fileList[fileListPointer], height);
		lv_obj_set_width(fileList[fileListPointer], width);
		lv_list_set_anim_time(fileList[fileListPointer], 0);
		lv_obj_t * obs[2]={fileList[fileListPointer]};
		setActiveGroup(FILE_SCREEN0 + fileListPointer,1, obs);
		lv_group_set_editing(groups[FILE_SCREEN0+fileListPointer],true);

		lv_obj_align(fileList[fileListPointer], NULL, LV_ALIGN_IN_TOP_MID, 0, 0);
		currarr current = UI.getCurrent(&fileListSz, &pos);
		MP3Player.update();
		for (unsigned i = 0; i < fileListSz; i++)
		{
			if (current[i][MAX_FILE_NAME] == 1)
			{
				currentFileList[i] = lv_list_add(fileList[fileListPointer], SYMBOL_DIRECTORY, current[i], fileScreenUpdate);
				lv_btn_set_style(currentFileList[i], LV_BTN_STATE_REL, &style_btn_rel);
				lv_btn_set_style(currentFileList[i], LV_BTN_STATE_PR, &style_btn_pr);
			}
			else if (current[i][MAX_FILE_NAME] == 2)
			{
				currentFileList[i] = lv_list_add(fileList[fileListPointer], SYMBOL_LEFT, "Back", fileScreenUpdate);
				lv_btn_set_style(currentFileList[i], LV_BTN_STATE_REL, &style_btn_rel);
				lv_btn_set_style(currentFileList[i], LV_BTN_STATE_PR, &style_btn_pr);
			}
			else if (current[i][MAX_FILE_NAME] == 3)
			{
				currentFileList[i] = lv_list_add(fileList[fileListPointer], SYMBOL_HOME, "Home", fileScreenUpdate);
				lv_btn_set_style(currentFileList[i], LV_BTN_STATE_REL, &style_btn_rel);
				lv_btn_set_style(currentFileList[i], LV_BTN_STATE_PR, &style_btn_pr);
			}
			else if (current[i][MAX_FILE_NAME] == 4)
			{
				currentFileList[i] = lv_list_add(fileList[fileListPointer], SYMBOL_HOME, current[i], fileScreenUpdate);
				lv_btn_set_style(currentFileList[i], LV_BTN_STATE_REL, &style_btn_rel);
				lv_btn_set_style(currentFileList[i], LV_BTN_STATE_PR, &style_btn_pr);
			}


