sivulich/TP_FINAL_MICROS_KINETIS/source/MP3Ui.c
			MP3Player.update();
		}
		for (unsigned i = 0; i < fileListSz; i++)
		{
			if (current[i][MAX_FILE_NAME] == 0)
			{
				if (checkMP3file(current[i], strlen(current[i])) == 0)
					currentFileList[i] = lv_list_add(fileList[fileListPointer], SYMBOL_FILE, current[i], fileScreenUpdate);
				else
					currentFileList[i] = lv_list_add(fileList[fileListPointer], SYMBOL_AUDIO, current[i], fileScreenUpdate);
				lv_btn_set_style(currentFileList[i], LV_BTN_STATE_REL, &style_btn_rel);
				lv_btn_set_style(currentFileList[i], LV_BTN_STATE_PR, &style_btn_pr);
			}
			else if (current[i][MAX_FILE_NAME] == 5)
			{
				currentFileList[i] = lv_list_add(fileList[fileListPointer], SYMBOL_DOWN, current[i], fileScreenUpdate);
				lv_btn_set_style(currentFileList[i], LV_BTN_STATE_REL, &style_btn_rel);
				lv_btn_set_style(currentFileList[i], LV_BTN_STATE_PR, &style_btn_pr);
			}
			lv_label_set_long_mode(lv_list_get_btn_label(currentFileList[i]), LV_LABEL_LONG_DOT);
			MP3Player.update();
		}
	}
	MP3Player.update();
	return LV_RES_OK;
}
lv_style_t style;
static void MainScreenCreate(void)
{
	mainScreen = lv_cont_create(baseScreen, NULL);
	lv_obj_set_size(mainScreen,LV_HOR_RES,LV_VER_RES-STATUS_BAR_HEIGHT);
	lv_obj_align(mainScreen,NULL,LV_ALIGN_IN_BOTTOM_MID,0,0);
	int width = lv_obj_get_width(mainScreen);
	int height= lv_obj_get_height(mainScreen);
	//lv_obj_set_pos(mainScreen,0,0);
	//static const char * btnm_map[] = { SYMBOL_AUDIO, SYMBOL_EDIT,"\n", SYMBOL_DIRECTORY,SYMBOL_SETTINGS, "" };
	/*Create a default button matrix*/
	//btnm1 = lv_btnm_create(mainScreen, NULL);
	//lv_btnm_set_map(btnm1, btnm_map);
	//lv_btnm_set_action(btnm1, btnm_action);
	//lv_obj_set_size(btnm1, LV_HOR_RES, LV_VER_RES);

	lv_style_copy(&style, &lv_style_plain);
	style.text.color = LV_COLOR_WHITE;
	style.text.font = &lv_font_dejavu_40;

	mainAudioBtn=lv_btn_create(mainScreen,NULL);
	lv_cont_set_fit(mainAudioBtn, false, false);
	lv_obj_set_size(mainAudioBtn,width/2, height/2);
	lv_obj_align(mainAudioBtn,mainScreen,LV_ALIGN_IN_TOP_LEFT,0,0);
	lv_btn_set_action(mainAudioBtn, LV_BTN_ACTION_CLICK, btn_action);
	lv_obj_t* label = lv_label_create(mainAudioBtn, NULL);
	lv_label_set_text(label, SYMBOL_AUDIO);
	lv_label_set_style(label,&style);

	mainEqBtn=lv_btn_create(mainScreen,NULL);
	lv_cont_set_fit(mainEqBtn, false, false);
	lv_obj_set_size(mainEqBtn,width/2, height/2);
	lv_obj_align(mainEqBtn,mainAudioBtn,LV_ALIGN_OUT_RIGHT_MID,0,0);
	lv_btn_set_action(mainEqBtn, LV_BTN_ACTION_CLICK, btn_action);
	label = lv_label_create(mainEqBtn, NULL);
	lv_label_set_text(label, SYMBOL_EDIT);
	lv_label_set_style(label,&style);

	mainFileBtn=lv_btn_create(mainScreen,NULL);
	lv_cont_set_fit(mainFileBtn, false, false);
	lv_obj_set_size(mainFileBtn,width/2, height/2);
	lv_obj_align(mainFileBtn,mainAudioBtn,LV_ALIGN_OUT_BOTTOM_MID,0,0);
	lv_btn_set_action(mainFileBtn, LV_BTN_ACTION_CLICK, btn_action);
	label = lv_label_create(mainFileBtn, NULL);
	lv_label_set_text(label, SYMBOL_DIRECTORY);
	lv_label_set_style(label,&style);

	mainSetBtn=lv_btn_create(mainScreen,NULL);
	lv_cont_set_fit(mainSetBtn, false, false);
	lv_obj_set_size(mainSetBtn,width/2, height/2);
	lv_obj_align(mainSetBtn,mainFileBtn,LV_ALIGN_OUT_RIGHT_MID,0,0);
	lv_btn_set_action(mainSetBtn, LV_BTN_ACTION_CLICK, btn_action);
	label = lv_label_create(mainSetBtn, NULL);
	lv_label_set_text(label, SYMBOL_SETTINGS);
	lv_label_set_style(label,&style);

	mainBtns[0]=mainAudioBtn;
	mainBtns[1]=mainEqBtn;
	mainBtns[2]=mainFileBtn;
	mainBtns[3]=mainSetBtn;

	/*Create a second button matrix with the new styles*/

	for(int i=0;i<4;i++)
	{
		//lv_btn_set_style(mainBtns[i], LV_BTN_STYLE_BG, &style_bg);
		lv_btn_set_style(mainBtns[i], LV_BTN_STYLE_REL, &style_btn_rel);
		lv_btn_set_style(mainBtns[i], LV_BTN_STYLE_PR, &style_btn_pr);
	}

	//lv_indev_set_group(kb_indev_main, groups[MAIN_SCREEN]);
}

static lv_obj_t* createRoller(const char* name, lv_coord_t x, lv_coord_t y, lv_coord_t w, lv_coord_t h)
{
	lv_obj_t *bassRoller = lv_roller_create(equalizerScreen, NULL);
	lv_obj_t *bassLabel = lv_label_create(equalizerScreen, NULL);
	lv_label_set_long_mode(bassLabel, LV_LABEL_LONG_ROLL);
	lv_label_set_align(bassLabel, LV_LABEL_ALIGN_CENTER);
	lv_obj_set_width(bassLabel, w);
	lv_label_set_static_text(bassLabel, name);
	char str[200]="";
	for(int i=-EQ_MAX_DB;i<=EQ_MAX_DB;i+=EQ_STEP_DB)
	{
		char strTemp[20];
		if(i+EQ_STEP_DB<=EQ_MAX_DB)
			sprintf(strTemp,"%d dB\n",i);
		else
			sprintf(strTemp,"%d dB",i);
		strcat(str,strTemp);
	}
	lv_roller_set_options(bassRoller, str);
	lv_roller_set_hor_fit(bassRoller, false);
	lv_obj_set_pos(bassRoller, x, y);
	lv_obj_set_width(bassRoller, w);
	//lv_obj_set_height(bassRoller, h);
	lv_roller_set_visible_row_count(bassRoller, 3);
	lv_roller_set_selected(bassRoller, EQ_MAX_DB, false);
	lv_obj_align(bassLabel, bassRoller, LV_ALIGN_OUT_TOP_MID, 0,0);
	lv_roller_set_style(bassRoller, LV_ROLLER_STYLE_BG, &style_btn_rel);
	lv_roller_set_style(bassRoller, LV_ROLLER_STYLE_SEL, &style_btn_pr);
	return bassRoller;
}

static  lv_obj_t* BackButtonCreate(lv_obj_t* p, lv_res_t (*fn)(lv_obj_t* obj))
{
	lv_obj_t* backBtn = lv_btn_create(p, NULL);
	lv_obj_set_pos(backBtn, 0, 0);
	lv_cont_set_fit(backBtn, false, false);
	lv_obj_set_width(backBtn, BACK_BUTTON_SIZE);
	lv_obj_set_height(backBtn, BACK_BUTTON_SIZE);
	lv_btn_set_action(backBtn, LV_BTN_ACTION_CLICK, fn);
	lv_obj_t* lab = lv_label_create(backBtn, NULL);
	lv_obj_set_height(lab, BACK_BUTTON_SIZE - 3);
	lv_label_set_text(lab, SYMBOL_LEFT);
	lv_btn_set_style(backBtn, LV_BTN_STATE_REL, &style_btn_rel);
	lv_btn_set_style(backBtn, LV_BTN_STATE_PR, &style_btn_pr);
	return backBtn;
}

static lv_res_t EqualizerScreenCB(lv_obj_t* r)
{
	//int gains[EQ_BANDS];
	for(int i = 0; i < EQ_BANDS; i++)
	{
		char dbs[10];
		lv_roller_get_selected_str(rollers[i],dbs);
		dbs[strlen(dbs)-3]=0;
		MP3PlayerData.equalizeBands[i] = atoi(dbs);
	}
	MP3Equalizer.setGains(MP3PlayerData.equalizeBands);
	return LV_RES_OK;
}

static void EqualizerScreenCreate(void)
{
	equalizerScreen = lv_cont_create(baseScreen, NULL);
	lv_obj_set_size(equalizerScreen,LV_HOR_RES,LV_VER_RES-STATUS_BAR_HEIGHT);
	lv_obj_align(equalizerScreen,NULL,LV_ALIGN_IN_BOTTOM_MID,0,0);
	int width = lv_obj_get_width(equalizerScreen);
	int height= lv_obj_get_height(equalizerScreen);

	lv_obj_set_style(equalizerScreen, &style_bg);
	static char *names[] = { "Bass","Mid","Trebble" };
	rollers[0]  = createRoller(names[0], 0* width / 3, height / 3, width / 3, height * 2 / 3);
	rollers[1]  = createRoller(names[1], 1*width/ 3, height / 3, width / 3, height * 2 / 3);
	rollers[2]  = createRoller(names[2], 2* width / 3, height / 3, width / 3, height * 2 / 3);
	lv_roller_set_action(rollers[0], EqualizerScreenCB);
	lv_roller_set_action(rollers[1], EqualizerScreenCB);
	lv_roller_set_action(rollers[2], EqualizerScreenCB);
	eqBackBtn = BackButtonCreate(equalizerScreen, retMainScreen);
}

lv_res_t LoopModeCB(lv_obj_t * btn)
{
	if(MP3PlayerData.playMode)
		lv_btn_set_state(btn, LV_BTN_STATE_TGL_PR);
	else
		lv_btn_set_state(btn, LV_BTN_STATE_TGL_REL);
	MP3PlayerData.playMode ^= 1;
	return LV_RES_OK;
}

static lv_res_t VumeterModeCB(lv_obj_t* r)
{
	char dbs[10];
	lv_roller_get_selected_str(r,dbs);
	MP3PlayerData.vumeterMode = atoi(dbs)-1;
	return LV_RES_OK;
}

static lv_res_t DateSelectorCB(lv_obj_t* r)
{
	char dbs[10];
	char year_buf[10];
	char month_buf[10];
	rtc_datetime_t date;
//	RTC_GetDatetime(RTC, &date);
	lv_roller_get_selected_str(date_rollers[0],year_buf);
	lv_roller_get_selected_str(date_rollers[1],month_buf);
	lv_roller_get_selected_str(date_rollers[2],dbs);
	int year = atoi(year_buf);
	int month = atoi(month_buf);

