sivulich/TP_FINAL_MICROS_KINETIS/source/MP3Ui.c
	date.year = year;
	date.month = month;
	date.day = atoi(dbs);
	lv_roller_get_selected_str(date_rollers[3],dbs);
	date.hour = atoi(dbs);
	lv_roller_get_selected_str(date_rollers[4],dbs);
	date.minute = atoi(dbs);
	date.second = 0;

	int maxDay = 30;
	if(month == 1 || month == 3 || month == 5 || month == 7 || month == 8 || month == 10 || month == 12)
		maxDay = 31;
	else if(month == 2){
		if( (year%4 == 0 && year%100 != 0) || year%400 == 0)
			maxDay = 29;
		else
			maxDay = 28;
	}
	char str[180]="";
	for(int i = 1; i <= maxDay; i++){
		char strTemp[5];
		if(i != maxDay)
			sprintf(strTemp,"%d\n",i);
		else
			sprintf(strTemp,"%d",i);
		strcat(str,strTemp);
	}
	lv_roller_set_options(date_rollers[2], str);

	/* RTC time counter has to be stopped before setting the date & time in the TSR register */
	RTC_StopTimer(RTC);
	RTC_SetDatetime(RTC, &date);
	RTC_StartTimer(RTC);
	return LV_RES_OK;
}

static lv_obj_t* createDateSelector(const char* name, lv_coord_t x, lv_coord_t y, lv_coord_t w, lv_coord_t h, int minValue, int maxValue, int value, lv_obj_t* prevRoller, int first){
	lv_obj_t *baseRoller = lv_roller_create(settingsScreen, NULL);
	lv_obj_t *baseLabel = lv_label_create(settingsScreen, NULL);

	lv_label_set_long_mode(baseLabel, LV_LABEL_LONG_ROLL);
	lv_label_set_align(baseLabel, LV_LABEL_ALIGN_CENTER);
	lv_obj_set_width(baseLabel, w);
	lv_label_set_static_text(baseLabel, name);

	char str[170] = "";
	for(int i = minValue; i <= maxValue; i++){
		char strTemp[5];
		if(i != maxValue)
			sprintf(strTemp,"%d\n",i);
		else
			sprintf(strTemp,"%d",i);
		strcat(str,strTemp);
	}
	lv_roller_set_options(baseRoller, str);
	lv_roller_set_hor_fit(baseRoller, false);
//	lv_obj_set_pos(vumeter_roller, x, y);

	if(first)
		lv_obj_align(baseRoller, loopModeBtn, LV_ALIGN_OUT_BOTTOM_LEFT,0,2*BACK_BUTTON_SIZE);
	else
		lv_obj_align(baseRoller, prevRoller, LV_ALIGN_OUT_RIGHT_MID,0,0);

	lv_obj_set_width(baseRoller, w);
	//lv_obj_set_height(bassRoller, h);
	lv_roller_set_visible_row_count(baseRoller, 3);
	lv_roller_set_selected(baseRoller, value-minValue, false);
	lv_obj_align(baseLabel, baseRoller, LV_ALIGN_OUT_TOP_MID, 0,0);
	lv_roller_set_style(baseRoller, LV_ROLLER_STYLE_BG, &style_btn_rel);
	lv_roller_set_style(baseRoller, LV_ROLLER_STYLE_SEL, &style_btn_pr);

	lv_roller_set_action(baseRoller, DateSelectorCB);
	return baseRoller;
}

static void SettingsScreenCreate(void)
{
	// Parent object for settings screen
	settingsScreen = lv_cont_create(baseScreen, NULL);
	lv_obj_set_size(settingsScreen,LV_HOR_RES,LV_VER_RES-STATUS_BAR_HEIGHT);
	lv_obj_align(settingsScreen,NULL,LV_ALIGN_IN_BOTTOM_MID,0,0);
	int width = lv_obj_get_width(playScreen);
	int height= lv_obj_get_height(playScreen);
	lv_obj_set_style(settingsScreen, &style_bg);

	//Loop mode button object
	lv_obj_t* label;
	loopModeBtn=lv_btn_create(settingsScreen,NULL);
	lv_cont_set_fit(loopModeBtn, false, false);
	lv_obj_set_size(loopModeBtn, width/2, height/3);

	lv_btn_set_state(loopModeBtn, LV_BTN_STATE_TGL_REL);  /*Set toggled state*/
	lv_obj_align(loopModeBtn,settingsScreen,LV_ALIGN_IN_TOP_LEFT,0,(BACK_BUTTON_SIZE));

	lv_btn_set_action(loopModeBtn,LV_BTN_ACTION_CLICK, LoopModeCB);
	label = lv_label_create(loopModeBtn, NULL);
	lv_label_set_text(label, "Loop Mode");

	//Vumeter mode select roller
	vumeter_roller = lv_roller_create(settingsScreen, NULL);
	lv_obj_t *vumeterLabel = lv_label_create(settingsScreen, NULL);
	lv_label_set_long_mode(vumeterLabel, LV_LABEL_LONG_ROLL);
	lv_label_set_align(vumeterLabel, LV_LABEL_ALIGN_CENTER);
	lv_obj_set_width(vumeterLabel, width/2);
	lv_label_set_static_text(vumeterLabel, "Vumeter Style");
	char str[12]="1\n2\n3\n4\n5\n6";
	lv_roller_set_options(vumeter_roller, str);
	lv_roller_set_hor_fit(vumeter_roller, false);
//	lv_obj_set_pos(vumeter_roller, x, y);
	lv_obj_align(vumeter_roller, loopModeBtn, LV_ALIGN_OUT_RIGHT_MID,0,0);
	lv_obj_set_width(vumeter_roller, width/2);
	//lv_obj_set_height(bassRoller, h);
	lv_roller_set_visible_row_count(vumeter_roller, 3);
	lv_roller_set_selected(vumeter_roller, 0, false);
	lv_obj_align(vumeterLabel, vumeter_roller, LV_ALIGN_OUT_TOP_MID, 0,0);
	lv_roller_set_style(vumeter_roller, LV_ROLLER_STYLE_BG, &style_btn_rel);
	lv_roller_set_style(vumeter_roller, LV_ROLLER_STYLE_SEL, &style_btn_pr);

	lv_roller_set_action(vumeter_roller, VumeterModeCB);

	//Date selector rollers
	rtc_datetime_t date;
	RTC_GetDatetime(RTC,&date);
	date_rollers[0] = createDateSelector("Year",0, 0, width/5, 10,	 2020, 2025,date.year,  date_rollers[0], 1);
	date_rollers[1] = createDateSelector("Month", 0, 0, width/5, 10, 1,    12, 	date.month, date_rollers[0], 0);
	date_rollers[2] = createDateSelector("Day", 0, 0, width/5, 10,	 1,    30, 	date.day,   date_rollers[1], 0);
	date_rollers[3] = createDateSelector("Hour", 0, 0, width/5, 10,	 0,    23, 	date.hour,  date_rollers[2], 0);
	date_rollers[4] = createDateSelector("Minute", 0, 0, width/5, 10,0,    59, 	date.minute,date_rollers[3], 0);

	setBackButton = BackButtonCreate(settingsScreen, retMainScreen);
}

static void FilesScreenCreate(void)
{
	filesScreen = lv_cont_create(baseScreen, NULL);
	lv_obj_set_size(filesScreen,LV_HOR_RES,LV_VER_RES-STATUS_BAR_HEIGHT);
	lv_obj_align(filesScreen,NULL,LV_ALIGN_IN_BOTTOM_MID,0,0);
	lv_obj_set_style(filesScreen, &style_bg);

	int width = lv_obj_get_width(filesScreen);
	int height= lv_obj_get_height(filesScreen);
	unsigned pos;
	currarr current = UI.getCurrent(&fileListSz, &pos);
	fileList[0] = lv_list_create(filesScreen, NULL);
	fileList[1] = lv_list_create(filesScreen, NULL);
	lv_obj_set_height(fileList[0], height);
	lv_obj_set_height(fileList[1], height);
	lv_obj_set_width(fileList[0], width);
	lv_obj_set_width(fileList[1], width);
	lv_obj_set_hidden(fileList[1], true);
	for (unsigned i = 0; i < fileListSz; i++)
	{
		if (current[i][MAX_FILE_NAME] == 1)
		{
			currentFileList[i] = lv_list_add(fileList[fileListPointer], SYMBOL_DIRECTORY, current[i], fileScreenUpdate);
			//lv_btn_set_style(currentFileList[i], LV_BTN_STYLE_BG, &style_bg);
			lv_btn_set_style(currentFileList[i], LV_BTN_STATE_REL, &style_btn_rel);
			lv_btn_set_style(currentFileList[i], LV_BTN_STATE_PR, &style_btn_pr);
		}
	}
	for (unsigned i = 0; i < fileListSz; i++)
	{
		if (current[i][MAX_FILE_NAME] == 0)
		{
			if (checkMP3file(current[i], strlen(current[i])) == 0)
				currentFileList[i] = lv_list_add(fileList[fileListPointer], SYMBOL_FILE, current[i], fileScreenUpdate);
			else
				currentFileList[i] = lv_list_add(fileList[fileListPointer], SYMBOL_AUDIO, current[i], fileScreenUpdate);
			lv_btn_set_style(currentFileList[i], LV_BTN_STATE_REL, &style_btn_rel);
			lv_btn_set_style(currentFileList[i], LV_BTN_STATE_PR, &style_btn_pr);
		}
	}
	lv_obj_align(fileList[fileListPointer], NULL, LV_ALIGN_IN_TOP_MID, 0, 0);
	//fileListBackBtn=BackButtonCreate(filesScreen, retMainScreen);
	groups[FILE_SCREEN0] = lv_group_create();
	lv_group_add_obj(groups[FILE_SCREEN0], fileList[0]);
	//lv_group_add_obj(groups[FILE_SCREEN0], fileListBackBtn);
	//lv_indev_set_group(kb_indev_list, groups[FILE_SCREEN0]);
	//groups[FILE_SCREEN1] = lv_group_create();
	//lv_group_add_obj(groups[FILE_SCREEN1], fileList[1]);
}
static void PlayScreenCreate(void)
{
	playScreen = lv_cont_create(baseScreen, NULL);
	lv_obj_set_size(playScreen,LV_HOR_RES,LV_VER_RES-STATUS_BAR_HEIGHT);
	lv_obj_align(playScreen,NULL,LV_ALIGN_IN_BOTTOM_MID,0,0);

	/*Create label on the screen. By default it will inherit the style of the screen*/

	songNameLbl = lv_label_create(playScreen, NULL);
	int width = lv_obj_get_width(playScreen);
	int height= lv_obj_get_height(playScreen);
	lv_obj_set_width(songNameLbl, width *3/ 4);
	lv_label_set_text(songNameLbl, "Song Name");
	lv_obj_align(songNameLbl, NULL, LV_ALIGN_IN_TOP_MID, 0, lv_obj_get_height(songNameLbl));

	lv_label_set_long_mode(songNameLbl, LV_LABEL_LONG_ROLL);

	artistNameLbl = lv_label_create(playScreen, NULL);
	lv_obj_set_width(artistNameLbl, width*3 / 4);
	lv_label_set_text(artistNameLbl, "Artist");
	lv_obj_align(artistNameLbl, songNameLbl, LV_ALIGN_OUT_BOTTOM_MID, 0, +lv_obj_get_height(artistNameLbl));

	lv_label_set_long_mode(artistNameLbl, LV_LABEL_LONG_ROLL);

	progressBar = lv_bar_create(playScreen, NULL);
	lv_bar_set_range(progressBar, 0, 0);
	lv_obj_set_width(progressBar, width *3/ 4);
	lv_obj_align(progressBar, artistNameLbl, LV_ALIGN_OUT_BOTTOM_MID, 0, +lv_obj_get_height(progressBar)/2);


	prevLbl = lv_label_create(playScreen,NULL);
	lv_label_set_text(prevLbl,SYMBOL_PREV);
	lv_obj_align(prevLbl,NULL,LV_ALIGN_IN_BOTTOM_LEFT,width/4,-5);

	nextLbl = lv_label_create(playScreen,NULL);
	lv_label_set_text(nextLbl,SYMBOL_NEXT);
	lv_obj_align(nextLbl,NULL,LV_ALIGN_IN_BOTTOM_RIGHT,-width/4,-5);

