sivulich/TP_FINAL_MICROS_KINETIS/source/MP3Ui.c
	playPauseLbl = lv_label_create(playScreen,NULL);
	lv_label_set_text(playPauseLbl,SYMBOL_PLAY);
	lv_obj_align(playPauseLbl,NULL,LV_ALIGN_IN_BOTTOM_MID,0,-5);


	playBackBtn=BackButtonCreate(playScreen, retMainScreen);
}

static void MP3UiSetSongInfo(const char* title, const char*artist, int dur,int first,float* eqPoints)
{
	if (first == 1)
	{
		lv_label_set_text(songNameLbl, title);
		lv_obj_set_width(songNameLbl, LV_HOR_RES *3 / 4);
		lv_obj_align(songNameLbl, NULL, LV_ALIGN_IN_TOP_MID, 0, lv_obj_get_height(songNameLbl));

		lv_label_set_text(artistNameLbl, artist);
		lv_obj_set_width(artistNameLbl, LV_HOR_RES *3/ 4);
		lv_obj_align(artistNameLbl, songNameLbl, LV_ALIGN_OUT_BOTTOM_MID, 0, +lv_obj_get_height(artistNameLbl));

		lv_bar_set_range(progressBar, 0, dur);
		lv_bar_set_value(progressBar, 0);
		lv_obj_align(progressBar, artistNameLbl, LV_ALIGN_OUT_BOTTOM_MID, 0, +lv_obj_get_height(progressBar)/2);
		currentTime = 0;
		duration = dur;
	}
	else
	{
		currentTime = dur;
		lv_bar_set_value(progressBar, currentTime);
	}
}

static void StylesInit()
{
	/*Background style*/
	lv_style_copy(&style_bg, &lv_style_plain);
	style_bg.body.main_color = LV_COLOR_SILVER;
	style_bg.body.grad_color = LV_COLOR_SILVER;
	style_bg.body.padding.hor = 0;
	style_bg.body.padding.ver = 0;
	style_bg.body.padding.inner = 0;

	/*General background style*/
	lv_style_copy(&style_bgg, &style_bg);
	style_bgg.body.main_color = LV_COLOR_MAKE(0xFF, 0xFF, 0xFF);
	style_bgg.body.grad_color = LV_COLOR_MAKE(0xFF, 0xFF, 0xFF);
	style_bgg.body.padding.hor = 0;
	style_bgg.body.padding.ver = 0;
	style_bgg.body.padding.inner = 0;

	
	/*Create button realese style*/
	lv_style_copy(&style_btn_rel, &lv_style_btn_rel);
	style_btn_rel.body.main_color = LV_COLOR_MAKE(0x30, 0x30, 0x30);
	style_btn_rel.body.grad_color = LV_COLOR_BLACK;
	style_btn_rel.body.border.color = LV_COLOR_SILVER;
	style_btn_rel.body.border.width = 1;
	style_btn_rel.body.border.opa = LV_OPA_50;
	style_btn_rel.body.radius = 5;

	/*Create button pressed style*/
	lv_style_copy(&style_btn_pr, &style_btn_rel);
	style_btn_pr.body.main_color = LV_COLOR_MAKE(0x55, 0x96, 0xd8);
	style_btn_pr.body.grad_color = LV_COLOR_MAKE(0x37, 0x62, 0x90);
	style_btn_pr.text.color = LV_COLOR_MAKE(0xbb, 0xd5, 0xf1);
}

static void statusBarCreate(void)
{
	volumeLabel = lv_label_create(baseScreen,NULL);
	lv_label_set_text(volumeLabel,SYMBOL_VOLUME_MAX " 15");
	lv_obj_align(volumeLabel, NULL, LV_ALIGN_IN_TOP_RIGHT, -20, 0);

	dateLabel = lv_label_create(baseScreen,NULL);
	lv_label_set_text(dateLabel,"dd/mm/aaaa hh:mm");
	lv_obj_align(dateLabel,NULL,LV_ALIGN_IN_TOP_MID,0,0);

	playInfoLabel = lv_label_create(baseScreen,NULL);
	lv_label_set_text(playInfoLabel,SYMBOL_PLAY" "SYMBOL_LOOP);
	lv_obj_align(playInfoLabel,NULL,LV_ALIGN_IN_TOP_LEFT,10,0);
}


static void MP3UiCreate(lv_indev_drv_t* kb_dr)
{
	rtc_config_t rtcConf;
	RTC_GetDefaultConfig(&rtcConf);
	RTC_Init(RTC,&rtcConf);
	RTC_SetClockSource(RTC);

	kb_drv = kb_dr;
	kb_indev = lv_indev_drv_register(kb_drv);
	UIinit=UI.init();
	StylesInit();
	baseScreen = lv_obj_create(NULL,NULL);
	statusBarCreate();
	MainScreenCreate();
	EqualizerScreenCreate();
	FilesScreenCreate();
	PlayScreenCreate();
	SettingsScreenCreate();
	lv_scr_load(baseScreen);
	hideAllScreens();
	lv_obj_set_hidden(mainScreen,0);
	setActiveGroup(MAIN_SCREEN,4,mainBtns);

	RTC_StartTimer(RTC);
	MP3UI.update();
}

static char* getMP3file()
{
	char* ret = UI.getFile();
	if(ret == (char*)-1)
	{
		return (char*)-1;
	}
	else if(newFile==1)
	{
		newFile=0;
		return newFileName;
	}
	return 0;

}

static void getMP3AdjFile(int off,char* dest)
{
	UI.getAdjFile(off,dest);
	while(checkMP3file(dest,strlen(dest))==0 && dest[0]!=0 && dest[0]!=(char)-1)
		UI.getAdjFile(off,dest);
}

static int lastVolume=0;

static void update()
{
	if(lastVolume!=MP3PlayerData.volume)
	{
		lastVolume=MP3PlayerData.volume;
		if(MP3PlayerData.volume == 0)
		{
			lv_label_set_text(volumeLabel,SYMBOL_MUTE" 0");
		}
		else if(MP3PlayerData.volume<(MAX_VOLUME * 2.0 / 3.0))
		{
			char txt[8];
			sprintf(txt,SYMBOL_VOLUME_MID" %d",MP3PlayerData.volume);
			lv_label_set_text(volumeLabel,txt);
		}
		else
		{
			char txt[8];
			sprintf(txt,SYMBOL_VOLUME_MAX" %d",MP3PlayerData.volume);
			lv_label_set_text(volumeLabel,txt);
		}

	}

	if(MP3PlayerData.currentScreen==PLAY_SCREEN)
	{
		if(MP3PlayerData.play==1)
			lv_label_set_text(playPauseLbl,SYMBOL_PAUSE);
		else
			lv_label_set_text(playPauseLbl,SYMBOL_PLAY);
	}

	rtc_datetime_t date;
	char text[50];
	RTC_GetDatetime(RTC,&date);
	sprintf(text,"%02d/%02d/%d %02d:%02d",date.day,date.month,date.year,date.hour,date.minute);
	lv_label_set_text(dateLabel,text);
	if(MP3PlayerData.play==1 && MP3PlayerData.playMode==1)
		lv_label_set_text(playInfoLabel,SYMBOL_PLAY" "SYMBOL_LOOP);
	else if(MP3PlayerData.play==0 && MP3PlayerData.playMode==1)
		lv_label_set_text(playInfoLabel,SYMBOL_PAUSE" "SYMBOL_LOOP);
	else if(MP3PlayerData.play==1 && MP3PlayerData.playMode==0)
		lv_label_set_text(playInfoLabel,SYMBOL_PLAY);
	else if(MP3PlayerData.play==0 && MP3PlayerData.playMode==0)
		lv_label_set_text(playInfoLabel,SYMBOL_PAUSE);



}

MP3UI_ MP3UI = {.init=MP3UiCreate,.getMP3file=getMP3file,.getAdjFile=getMP3AdjFile,.setSongInfo=MP3UiSetSongInfo,.update=update};
